# 这一文件是向你介绍
# R 编程语言。我们首先来解开一个
# 小秘密！

# 1. 运行以下代码来创建向量 'udacious'。
# 你需要突出显示代码的所有行，然后
# 运行代码。你应该看到 “udacious” 出现在工作区中。

udacious <- c("Chris Saden", "Lauren Castellano",

​              "Sarah Spikes","Dean Eckles",

​              "Andy Brown", "Moira Burke",

​              "Kunal Chawla")

# 你应该在 '环境' 中看到类似 “chr [1：7]”，
# 或 '工作区' 选项卡. 这是因为你创建了一个 '向量'
# 该向量具有7个 '类型' 字符的名称。形似箭头
# '<-' 符号是 R 中的赋值运算符，类似于
# 在其他编程语言中的等号'='。c() 是一个
# 泛型函数，它结合参数，在这种情况下
# 是人的名字，形成一个向量。

# ‘矢量’ 是 R 中的数据类型之一。矢量必须包含
# 相同类型的数据，即条目必须全部是
# 相同类型：字符（大多数程序员称这些字符串），
# 逻辑（TRUE 或 FALSE）或数字。

# 通过运行下一行代码输出向量 udacious。

udacious

# 注意输出旁边有数字。
# 每个数字对应于向量中条目的索引。
# Chris Saden 是第一个条目 [1]
# Dean Eckles 是第四个条目 [4]
# Kunal Chawla 是第七个条目 [7]

# 根据你的窗口大小，你可能会在输出中看到
# 不同的数字。

# 另一个有用的提示：你可以将值添加到矢量。
# 一次一行地运行每行代码，看看会发生什么。

numbers <- c(1:10)

numbers

numbers <- c(numbers, 11:20)

numbers

# 2. 将 YOUR_NAME 替换为向量'udacious'中的实际名称

# 并运行代码。记住一定要使用引号。

udacious <- c("Chris Saden", "Lauren Castellano",

​              "Sarah Spikes","Dean Eckles",

​              "Andy Brown", "Moira Burke",

​              "Kunal Chawla", YOUR_NAME)

# 注意 R 如何在工作区更新 'udacious'。

# 现在应该说 'chr[1:8]'。

# 3. 运行以下两行代码。你可以突出显示两行

# 代码并运行它们。

mystery = nchar(udacious)

mystery

# 你刚刚创建了一个名为 mystery 的新向量。你认为在向量中

# 含有什么？（向下滚动以获得答案）

# Mystery 是一个包含字符数的向量

# 含有每个在 Udacious 中的名字，包括你的名字。

# 4. 运行以下这行代码。

mystery == 11

# 这里我们得到一个逻辑（或布尔）向量

# 它告诉我们矢量中的哪些位置或索引包含正好有

# 11个字符的名称。

# 5.让我们使用这个布尔向量，mystery，在我们的 udacious 向量中

# 出现子集。你认为运行下面的代码行时，

# 结果会是什么？

# 在运行下一行代码之前考虑输出。

# 请注意代码中的括号。括号通常

# 在 R 中用于子集

udacious[mystery == 11]

# 向下滚动以获取答案

# 这是你的 Udacious 讲师的课程！

# (如果你足够幸运，你可能会在输出

# 中有 11 个字符 YOUR_NAME) 无论哪种方式，我们

# 认为你学习这门课程勇气可嘉并值得鼓励。

# 6. 现在把所有的秘密放在一边...让我们来深入探索一些数据！

# 在 R 中已经有几个内置的数据集

# 你可以尝试。现在，你将加载其中一个

# 名为 mtcars 的数据。

# 运行下一行命令来加载 mtcars 数据。

data(mtcars)

# 你应该看到mtcars出现在 ‘环境’ 标签中

# <Promise> 的一旁列出。

# 对象（mtcars）显示为在工作区的 ‘Promise’ 对象

# 直到我们运行一些使用该对象的代码。

# R 已经将 mtcars 数据存储到类似电子表格的对象中

# 这被称为数据框。运行下一个命令来查看哪些变量

# 在数据集中并将数据集完全加载为

# 在 R 的对象。你应该看到 <Promise> 消失

# 在你运行下一行代码时。

# 如果你想要有对 Promise 对象的专家洞察力，

# 请访问 http://cran.r-project.org/doc/manuals/r-release/R-lang.html#Promise-objects 了解更多

# 你其实并不需要 Promise 对象的信息才能在本课程中成功。

names(mtcars)

# names(mtcars) 应该输出所有

# 在数据集中的变量名字。你可能会注意到汽车的名字

# 不是数据集中的变量。 车名已经保存

# 作为行名称。这点稍后再说。

# 你还应该看看有多少在数据框中的观察值 (obs.) 

# 和每一观察值的变量数量。

# 7. 想要获取关于数据集和变量的更多信息

# 运行以下这行代码。

?mtcars

# 你可以在任何命令或数据集前输入' ？'来了解更多详情。

# 细节和文档将显示在

# '帮助' 标签中.

# 8. 要输出数据，请将下一行作为代码运行。

mtcars

# 在控制台中上下滚动查看数据。

# 这是输出的整个数据框。

# 9. 运行以下两个函数，一次一个，

# 看看你是否能弄清楚它们做了什么。

str(mtcars)

dim(mtcars)

# 向下滚动以获得答案。

# 第一个命令 str（mtcars）提供了数据框结构

# 它列出了变量名称，每个变量的类型

# (所有这些变量都是数字) 和每一变量的

# 一些值。

# 第二个命令, dim(mtcars), 应该输出 '[1] 32 11'

# 到控制台。 [1] 表示 32 在输出中

# 是第一个值。

# R 使用 1 来开始索引 (AND NOT ZERO BASED INDEXING 

# 在许多其他编程语言中是正确的。)

# 10. 如果你想了解更多，可以阅读 row.names 的文档。

?row.names

# 运行此代码以查看数据框中的当前行名称。

row.names(mtcars)

# 运行此代码将汽车的行名称更改为数字。

row.names(mtcars) <- c(1:32)

# 通过运行下面的代码来输出数据框。

mtcars

# 用正确的汽车名称重新标记我们的数据框是很乏味的

# 让我们重新加载数据集并输出前十行。

data(mtcars)

head(mtcars, 10)

# head（）函数默认输出数据框的前六行

# 运行以下代码来查看。

head(mtcars)

# 我想你会知道这是做什么的。

tail(mtcars, 3)

# 11. 到目前为止我们已经运行了九个命令：

#      c, nchar, data, str, dim, names, row.names, head, and tail.

# 所有这些命令都有一些输入或参数。

# 确定一个命令是否需要更多的参数

# 或学习任何默认设置，你可以查阅文档

# 在命令前使用 '?', 就像你之前在学习

# the mtcars 数据集 与 the row.names 时的操作类似。

# 12. 让我们仔细检查我们的汽车数据。我们可以

# 使用符号 '$' 访问数据框中的单个变量 (或 列）

# 运行以下代码并输出变量

# 英里每加仑。 这是数据框中的 mpg 列。

mtcars$mpg

# 输出任何两个其他变量到控制台。

# 这是一个包含 32 辆车的 mpg（英里/加仑）向量

# 运行下一行代码来获取所有车的平均 mpg

# 这是什么?

# 在优达学城网站上输入练习的编号。

# https://www.udacity.com/course/viewer#!/c-ud651/l-729069797/e-804129314/m-830829287

mean(mtcars$mpg)